Martins-Lucaas/PRJ-SEMB/STM32IDE/Multiparameter_Monitor/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "z_displ_ILI9XXX.h"

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TOUCH_INT_Pin GPIO_PIN_4
#define TOUCH_INT_GPIO_Port GPIOA
#define DISPL_SCK_Pin GPIO_PIN_5
#define DISPL_SCK_GPIO_Port GPIOA
#define TOUCH_MISO_Pin GPIO_PIN_6
#define TOUCH_MISO_GPIO_Port GPIOA
#define DISPL_MOSI_Pin GPIO_PIN_7
#define DISPL_MOSI_GPIO_Port GPIOA
#define usart_emg_rx_Pin GPIO_PIN_5
#define usart_emg_rx_GPIO_Port GPIOC
#define temp_scl_Pin GPIO_PIN_10
#define temp_scl_GPIO_Port GPIOB
#define DISPL_CS_Pin GPIO_PIN_12
#define DISPL_CS_GPIO_Port GPIOB
#define TOUCH_CS_Pin GPIO_PIN_13
#define TOUCH_CS_GPIO_Port GPIOB
#define DISPL_DC_Pin GPIO_PIN_14
#define DISPL_DC_GPIO_Port GPIOB
#define DISPL_RST_Pin GPIO_PIN_15
#define DISPL_RST_GPIO_Port GPIOB
#define DISPL_LED_Pin GPIO_PIN_7
#define DISPL_LED_GPIO_Port GPIOC
#define oxi_sda_Pin GPIO_PIN_9
#define oxi_sda_GPIO_Port GPIOC
#define oxi_scl_Pin GPIO_PIN_8
#define oxi_scl_GPIO_Port GPIOA
#define led_adc_Pin GPIO_PIN_9
#define led_adc_GPIO_Port GPIOA
#define usart_emg_tx_Pin GPIO_PIN_10
#define usart_emg_tx_GPIO_Port GPIOC
#define temp_sda_Pin GPIO_PIN_12
#define temp_sda_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
